[
  "Admit your most embarrassing secret",
  "Are you hiding anything from your best friend?",
  "Before now, when did you last lie?",
  "Biggest fear you have never told anyone?",
  "Craziest thing you've done for love?",
  "Can you tell us your most shameful moment?",
  "Describe your most awkward date experience",
  "Dumbest thing you believed as a child?",
  "Ever had a crush on a teacher?",
  "Embarrassing text you sent to wrong person?",
  "Funniest lie you told your parents?",
  "First person you ever had a crush on?",
  "Grossest thing you've ever eaten?",
  "Guilty pleasure you're ashamed of?",
  "Have you ever cheated on a test?",
  "Hardest you've ever cried and why?",
  "If you could erase one memory, what would it be?",
  "Insecurity you try hardest to hide?",
  "Jealous moment you're not proud of?",
  "Judge someone based on their appearance recently?",
  "Keep any secrets from your family?",
  "Kindest thing you've done that nobody knows?",
  "Last time you cried yourself to sleep?",
  "Lie you told that got out of control?",
  "Most embarrassing thing in your search history?",
  "Money you've stolen from family?",
  "Nastiest rumor you've spread about someone?",
  "Never told anyone about your addiction to what?",
  "One thing you'd change about your personality?",
  "Obvious lie someone told that you pretended to believe?",
  "Person you pretend to like but actually hate?",
  "Private thing you do that you'd die if others knew?",
  "Question you're afraid someone will ask you?",
  "Quickest you've fallen for someone?",
  "Really weird habit you have?",
  "Rudest thing you've done to a stranger?",
  "Secret you've kept from your best friend?",
  "Strangest dream you remember having?",
  "Time you were caught in an embarrassing situation?",
  "Truth about yourself you've never admitted?",
  "Ugliest thing about your personality?",
  "Unforgivable thing you've done to someone?",
  "Very inappropriate thought you've had about someone?",
  "Vindictive thing you've done for revenge?",
  "Worst thing you've done behind someone's back?",
  "Weird thing you do when you think nobody's watching?",
  "eXcuse you've used to get out of plans?",
  "eXtreme thing you've done that nobody knows?",
  "Years ago, what's something you did that still embarrasses you?",
  "Yell at someone for something that was actually your fault?",
  "Zero friends period - what's your loneliest moment?",
  "Zealous about something weird that others would judge?"
]